emacs_studio/howtoUseEmacs.org
* Tutorial: how to use emacs
** Frequency used shortcut key and very useful stuff
   Manually Defined:
- open recent files   
C-x C-r [M-x recentf-open-files]: open recent files
- How to input code block quickly "<s + TAB"
Input "<s" and then type <TAB>

#+BEGIN_SRC 

#+END_SRC
** Mode and Buffer Introduction
- major mode: only one
- minor mode: 0-n; for Example: tool-bar, scroll bar

C-h m: look up all the enabled minor mode
- help buffer
** control command
- c-g: quit
- g: refresh the dired view of the current directory to see change
  
** Getting Help
M-x find-fuction
M-x find-variable
C-h k: describe the function a key runs
C-h f: describe a function
C-h m: get mode-specific information, and this cna list the models currently used
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-h C-f") 'find-function)
(global-set-key (kbd "C-h C-v") 'find-variable)
(global-set-key (kbd "C-h C-k") 'find-function-on-key
#+END_SRC

** File and  Buffer commands
- c-x c-f: open a file
- c-x c-k: kill the buffer reprsenting a file .... not deleteing a file

- C-x s: saves all fiels with a prompt
- C-x C-s: saves file without a prompt
- C-s C-w: saves the file with a different name. Askss you for the name

- c-x b: switch to a different buffer in a window, asks you which buffer to swich to
- C-x C-b: Switches buffers, but shows you the list of buffers in a new window

  
- m-<: begining of the buffer
- m->: end of the file

- M-x recover-file: recovers the auto-saved file
- M-x write-file: write the buffer to a different file
** Mouse move command
*** word
- c-f: move forward one character
- c-b: move back one character
- M-f: move forward one world
- M-b: move back one world
*** line
- c-p: previous line/up
- c-n: next line/down
- c-a: move to the beginning of the a line
- c-e: move to the end of the line
*** page
- c-v: gage down
- m-v: page up
*** screen
- c-l: center the screen

** Edit command
- c-d: delete a character
- m-d: delete a word

- c-_: undo
- c-/: undo
- C-g c-/: Redo

- c-w: cut
- c-y: yandk/paste

- m-u: upper case
- m-l: lower case
- m-c: capitalize

** Multiple Windos
- C-M-v: scroll other window   
- c-x 2: split top/down
- c-x 3: split left/right
- c-x o: other window

