emacs_studio/howtoUseEmacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-07 Sun 23:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yubao" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd5b90d1">1. Tutorial: how to use emacs</a>
<ul>
<li><a href="#org3b4040c">1.1. Frequency used shortcut key and very useful stuff</a></li>
<li><a href="#orgef6081a">1.2. Mode and Buffer Introduction</a></li>
<li><a href="#org9bb99cb">1.3. control command</a></li>
<li><a href="#orgf33b246">1.4. Getting Help</a></li>
<li><a href="#org0dc932f">1.5. File and  Buffer commands</a></li>
<li><a href="#org8539a19">1.6. Mouse move command</a>
<ul>
<li><a href="#orgc57b8ad">1.6.1. word</a></li>
<li><a href="#orgc94f097">1.6.2. line</a></li>
<li><a href="#org0efcd55">1.6.3. page</a></li>
<li><a href="#org87acd3c">1.6.4. screen</a></li>
</ul>
</li>
<li><a href="#org541f07f">1.7. Edit command</a></li>
<li><a href="#orgfc143b4">1.8. Multiple Windos</a></li>
<li><a href="#orgf9c2cd4">1.9. search</a></li>
<li><a href="#orgac3f6e0">1.10. mark</a></li>
<li><a href="#org5ae2b47">1.11. check</a></li>
<li><a href="#orgcc8c7d0">1.12. shell</a></li>
<li><a href="#orgc5775ca">1.13. Customize variavle, group, mode, function</a></li>
</ul>
</li>
<li><a href="#orgbb95ca6">2. Configuration for project and IDE</a>
<ul>
<li><a href="#org940ee48">2.1. Package Management</a></li>
<li><a href="#orgef27b20">2.2. linum Mode</a></li>
<li><a href="#org9f488b4">2.3. Company Mode</a></li>
<li><a href="#org56d71ba">2.4. Speedbar</a></li>
<li><a href="#org9b722f4">2.5. Compile</a></li>
<li><a href="#orga3128cb">2.6. Debug</a></li>
<li><a href="#org7acaa37">2.7. Format</a></li>
<li><a href="#orgea4159f">2.8. Show match parents "()"</a></li>
<li><a href="#org75af25c">2.9. Highlight current line</a></li>
<li><a href="#orgcd7cee8">2.10. Disable backup file (*.~)</a></li>
<li><a href="#org3fc6b4a">2.11. Enable Recent Files</a></li>
<li><a href="#orgcfc38da">2.12. Delete Selection Mode</a></li>
<li><a href="#org44e793e">2.13. Install Hungary Delete mode</a></li>
<li><a href="#orga4c20d4">2.14. Install a Theme</a></li>
<li><a href="#orgbcda61b">2.15. Install swiper and counsel</a></li>
<li><a href="#org630e8a0">2.16. Install and Configure Smartparens mode</a></li>
<li><a href="#org937b1b2">2.17. Configure Javascript IDE</a></li>
</ul>
</li>
<li><a href="#org4f37092">3. org-mode basics</a>
<ul>
<li><a href="#org5343615">3.1. Introduction and Common Configuration</a>
<ul>
<li><a href="#org365e2db">3.1.1. How to enter source code edit mode</a></li>
</ul>
</li>
<li><a href="#org922759c">3.2. Schedule and Calenda and Todo</a>
<ul>
<li><a href="#orgdfb5a84">3.2.1. <span class="todo TODO">TODO</span> todo</a></li>
<li><a href="#org66e7474">3.2.2. <span class="done DONE">DONE</span> done</a></li>
</ul>
</li>
<li><a href="#org3214647">3.3. Links</a></li>
</ul>
</li>
<li><a href="#org8638a36">4. Emacs Lisp</a>
<ul>
<li><a href="#org2063eba">4.1. Study Resources</a></li>
<li><a href="#org29a9910">4.2. Command</a></li>
<li><a href="#orgc94da6e">4.3. Elisp Grammer</a>
<ul>
<li><a href="#org54e8be7">4.3.1. Example</a></li>
<li><a href="#orgee984b1">4.3.2. Variable</a></li>
<li><a href="#org21c148e">4.3.3. Function</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf8ab219">5. Reference</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd5b90d1" class="outline-2">
<h2 id="orgd5b90d1"><span class="section-number-2">1</span> Tutorial: how to use emacs</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org3b4040c" class="outline-3">
<h3 id="org3b4040c"><span class="section-number-3">1.1</span> Frequency used shortcut key and very useful stuff</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Manually Defined:
</p>
<ul class="org-ul">
<li>open recent files</li>
</ul>
<p>
C-x C-r [M-x recentf-open-files]: open recent files
</p>
<ul class="org-ul">
<li>How to input code block quickly "&lt;s + TAB"</li>
</ul>
<p>
Input "&lt;s" and then type &lt;TAB&gt;
</p>

<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-orgef6081a" class="outline-3">
<h3 id="orgef6081a"><span class="section-number-3">1.2</span> Mode and Buffer Introduction</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>major mode: only one</li>
<li>minor mode: 0-n; for Example: tool-bar, scroll bar</li>
</ul>

<p>
C-h m: look up all the enabled minor mode
</p>
<ul class="org-ul">
<li>help buffer</li>
</ul>
</div>
</div>
<div id="outline-container-org9bb99cb" class="outline-3">
<h3 id="org9bb99cb"><span class="section-number-3">1.3</span> control command</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>c-g: quit</li>
<li>g: refresh the dired view of the current directory to see change</li>
</ul>
</div>
</div>

<div id="outline-container-orgf33b246" class="outline-3">
<h3 id="orgf33b246"><span class="section-number-3">1.4</span> Getting Help</h3>
<div class="outline-text-3" id="text-1-4">
<p>
M-x find-fuction
M-x find-variable
C-h k: describe the function a key runs
C-h f: describe a function
C-h m: get mode-specific information, and this cna list the models currently used
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd "C-h C-f") 'find-function)
(global-set-key (kbd "C-h C-v") 'find-variable)
(global-set-key (kbd "C-h C-k") 'find-function-on-key
</pre>
</div>
</div>
</div>

<div id="outline-container-org0dc932f" class="outline-3">
<h3 id="org0dc932f"><span class="section-number-3">1.5</span> File and  Buffer commands</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>c-x c-f: open a file</li>
<li>c-x c-k: kill the buffer reprsenting a file &#x2026;. not deleteing a file</li>

<li>C-x s: saves all fiels with a prompt</li>
<li>C-x C-s: saves file without a prompt</li>
<li>C-s C-w: saves the file with a different name. Askss you for the name</li>

<li>c-x b: switch to a different buffer in a window, asks you which buffer to swich to</li>
<li>C-x C-b: Switches buffers, but shows you the list of buffers in a new window</li>
</ul>


<ul class="org-ul">
<li>m-&lt;: begining of the buffer</li>
<li>m-&gt;: end of the file</li>

<li>M-x recover-file: recovers the auto-saved file</li>
<li>M-x write-file: write the buffer to a different file</li>
</ul>
</div>
</div>
<div id="outline-container-org8539a19" class="outline-3">
<h3 id="org8539a19"><span class="section-number-3">1.6</span> Mouse move command</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-orgc57b8ad" class="outline-4">
<h4 id="orgc57b8ad"><span class="section-number-4">1.6.1</span> word</h4>
<div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
<li>c-f: move forward one character</li>
<li>c-b: move back one character</li>
<li>M-f: move forward one world</li>
<li>M-b: move back one world</li>
</ul>
</div>
</div>
<div id="outline-container-orgc94f097" class="outline-4">
<h4 id="orgc94f097"><span class="section-number-4">1.6.2</span> line</h4>
<div class="outline-text-4" id="text-1-6-2">
<ul class="org-ul">
<li>c-p: previous line/up</li>
<li>c-n: next line/down</li>
<li>c-a: move to the beginning of the a line</li>
<li>c-e: move to the end of the line</li>
</ul>
</div>
</div>
<div id="outline-container-org0efcd55" class="outline-4">
<h4 id="org0efcd55"><span class="section-number-4">1.6.3</span> page</h4>
<div class="outline-text-4" id="text-1-6-3">
<ul class="org-ul">
<li>c-v: gage down</li>
<li>m-v: page up</li>
</ul>
</div>
</div>
<div id="outline-container-org87acd3c" class="outline-4">
<h4 id="org87acd3c"><span class="section-number-4">1.6.4</span> screen</h4>
<div class="outline-text-4" id="text-1-6-4">
<ul class="org-ul">
<li>c-l: center the screen</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org541f07f" class="outline-3">
<h3 id="org541f07f"><span class="section-number-3">1.7</span> Edit command</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>c-d: delete a character</li>
<li>m-d: delete a word</li>

<li>c-_: undo</li>
<li>c-/: undo</li>
<li>C-g c-/: Redo</li>

<li>c-w: cut</li>
<li>c-y: yandk/paste</li>

<li>m-u: upper case</li>
<li>m-l: lower case</li>
<li>m-c: capitalize</li>
</ul>
</div>
</div>

<div id="outline-container-orgfc143b4" class="outline-3">
<h3 id="orgfc143b4"><span class="section-number-3">1.8</span> Multiple Windos</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>C-M-v: scroll other window</li>
<li>c-x 2: split top/down</li>
<li>c-x 3: split left/right</li>
<li>c-x o: other window</li>
</ul>
</div>
</div>
