emacs_studio/howtoUseEmacs.tex
% Created 2017-05-08 Mon 01:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{yubao}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={yubao},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.6)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Tutorial: how to use emacs}
\label{sec:orgb93ef2e}
\subsection{Frequency used shortcut key and very useful stuff}
\label{sec:org8567fcb}
Manually Defined:
\begin{itemize}
\item open recent files
\end{itemize}
C-x C-r [M-x recentf-open-files]: open recent files
\begin{itemize}
\item How to input code block quickly "<s + TAB"
\end{itemize}
Input "<s" and then type <TAB>
\subsection{Mode and Buffer Introduction}
\label{sec:orge18ab9f}
\begin{itemize}
\item major mode: only one
\item minor mode: 0-n; for Example: tool-bar, scroll bar
\end{itemize}

C-h m: look up all the enabled minor mode
\begin{itemize}
\item help buffer
\end{itemize}
\subsection{control command}
\label{sec:org0bab889}
\begin{itemize}
\item c-g: quit
\item g: refresh the dired view of the current directory to see change
\end{itemize}

\subsection{Getting Help}
\label{sec:org98903d2}
M-x find-fuction
M-x find-variable
C-h k: describe the function a key runs
C-h f: describe a function
C-h m: get mode-specific information, and this cna list the models currently used
\begin{verbatim}
(global-set-key (kbd "C-h C-f") 'find-function)
(global-set-key (kbd "C-h C-v") 'find-variable)
(global-set-key (kbd "C-h C-k") 'find-function-on-key
\end{verbatim}

\subsection{File and  Buffer commands}
\label{sec:orge14e87e}
\begin{itemize}
\item c-x c-f: open a file
\item c-x c-k: kill the buffer reprsenting a file \ldots{}. not deleteing a file

\item C-x s: saves all fiels with a prompt
\item C-x C-s: saves file without a prompt
\item C-s C-w: saves the file with a different name. Askss you for the name

\item c-x b: switch to a different buffer in a window, asks you which buffer to swich to
\item C-x C-b: Switches buffers, but shows you the list of buffers in a new window
\end{itemize}


\begin{itemize}
\item m-<: begining of the buffer
\item m->: end of the file

\item M-x recover-file: recovers the auto-saved file
\item M-x write-file: write the buffer to a different file
\end{itemize}
\subsection{Mouse move command}
\label{sec:org745ba2a}
\subsubsection{word}
\label{sec:org7f30348}
\begin{itemize}
\item c-f: move forward one character
\item c-b: move back one character
\item M-f: move forward one world
\item M-b: move back one world
\end{itemize}
\subsubsection{line}
\label{sec:orgac9fbf8}
\begin{itemize}
\item c-p: previous line/up
\item c-n: next line/down
\item c-a: move to the beginning of the a line
\item c-e: move to the end of the line
\end{itemize}
\subsubsection{page}
\label{sec:orgdf84813}
\begin{itemize}
\item c-v: gage down
\item m-v: page up
\end{itemize}
\subsubsection{screen}
\label{sec:org48b556d}
\begin{itemize}
\item c-l: center the screen
\end{itemize}

\subsection{Edit command}
\label{sec:orgdd5bda0}
\begin{itemize}
\item c-d: delete a character
\item m-d: delete a word

\item c-\_: undo
\item c-/: undo
\item C-g c-/: Redo

\item c-w: cut
\item c-y: yandk/paste

\item m-u: upper case
\item m-l: lower case
\item m-c: capitalize
\end{itemize}

\subsection{Multiple Windos}
\label{sec:org2c70ec6}
\begin{itemize}
\item C-M-v: scroll other window
\item c-x 2: split top/down
\item c-x 3: split left/right
\item c-x o: other window
\end{itemize}
