emacs_studio/howtoUseEmacs.org
** search
- c-s text: search
- c-s TEXT: case sensitive search
- m-x query-replace <----> m-%
- m-x replace-string

- M-C-s: search a regexp

- M-s o: searches and shows alll the occurances in an *Occur* buffer. You can click on the lines to jump to those lines.

- m-x grep <enter>

** mark
- c-space: start/toggle marking a region

** check

- m-$: spell check word
- m-x flyspell-mode
- m-x ispell-region: check a small region
- m-x ispell-buffer: check all of the buffer

** shell
- m-x shell: start a bash command line

** Customize variavle, group, mode, function
   
* Configuration for project and IDE
** Package Management
- Introduction
MELPA: Milkypostman's Emacs Lisp Package Archives
- M-x  package-list-packages
d: delete
i: install
x: execute
- [[https://melpa.org/][melpa.org]]
- Add melpa package
#+BEGIN_SRC  emacs-lisp
  ;;;initialize package
  (require 'package)
  (setq package-archives '(
  ;			 ("gnu" . "https://elpa.gnu.org/packages/")
;			   ("melpa" . "https://melpa.org/packages/")
			   ("melpa-stable" . "https:://stable.melpa.org/packages/"))
  )
  (package-initialize)
#+END_SRC
- Auto install package configuration
  #+BEGIN_SRC emacs-lisp

(when (>= emacs-major-version 24)
  (require 'package)
  (package-initialize)
  (add-to-list 'package-archives  '(
				    ("melpa" . "https://melpa.org/packages/"))))
(require 'cl)
;;add whatever package you want here
(defvar yubao/packages '(
			 company
			 )
  "Default packages")
(defun yubao/packages-installed-p ()
  (loop for pkg in yubao/packages
	when (not (package-installed-p pkg)) do (return nil)
	finally (return t)))

(unless (yubao/packages-installed-p)
  (message "%s" "Refreshing package database .... ")
  (package-refresh-contents)
  (dolist (pkg yubao/packages)
    (when (not (package-installed-p pkg))
      (package-install pkg))))
  #+END_SRC
** linum Mode
(global-linum-mode t)
(linum-mode t)

** Company Mode
- [[http://company-mode.github.io/][company-mode]]   
- What's Company Mode?
Company => company anything
- How to enable company mode?

(company-mode t);work on current buffer
(global-company-mode t);work on all the opened buffer

Use M-n or M-p to select candidate item
** Speedbar
  m-x speedbar <enter> or m-x speed <tab> <enter> :list project files
** Compile
  m-x compile
** Debug
  c-x ` : jump to the next error. That ` is a back quote on the top left of the keyboard
** Format
- Auto Update the Sequence Number
Example:
1. first
2. second
3. third
4. fourth

Then I want to insert one item:   
Example:
1. first
2. second
3. Inserted new item
3. third
4. fourth

Therefore, think a question: how to auto sort the list?

Method:

Move the curser to the end, and press 'M' (meta), and then press Return key.

Sorted items:
1. first
2. second
3. Inserted new item
4. third
5. fourth

7. Indent
   M-x indent-gegion: indents the region
** Show match parents "()"
[menu]=>[Options]=>[Highlight Matching Parentheses]

#+BEGIN_SRC emacs-lisp
  (add-hook 'emacs-lisp-mode-hook 'show-paren-mode)
#+END_SRC
** Highlight current line
#+BEGIN_SRC emacs-lisp
  (global-hl-line-mode t)
#+END_SRC
** Disable backup file (*.~)
#+BEGIN_SRC emacs-lisp
;;disable backup file (*.~)
(setq make-backup-files nil)
#+END_SRC
** Enable Recent Files
#+BEGIN_SRC emacs-lisp
     (require 'recentf)
     (recentf-mode t)
     (setq recentf-max-menu-items 25)
     ;;uncomment this statement if u want to use shortcut key
     (global-set-key "\C-x\ \C-r" 'recentf-open-files)
#+END_SRC
