emacs_studio/howtoUseEmacs.html

<div id="outline-container-orgf9c2cd4" class="outline-3">
<h3 id="orgf9c2cd4"><span class="section-number-3">1.9</span> search</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>c-s text: search</li>
<li>c-s TEXT: case sensitive search</li>
<li>m-x query-replace &lt;-&#x2014;&gt; m-%</li>
<li>m-x replace-string</li>

<li>M-C-s: search a regexp</li>

<li>M-s o: searches and shows alll the occurances in an <b>Occur</b> buffer. You can click on the lines to jump to those lines.</li>

<li>m-x grep &lt;enter&gt;</li>
</ul>
</div>
</div>

<div id="outline-container-orgac3f6e0" class="outline-3">
<h3 id="orgac3f6e0"><span class="section-number-3">1.10</span> mark</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>c-space: start/toggle marking a region</li>
</ul>
</div>
</div>

<div id="outline-container-org5ae2b47" class="outline-3">
<h3 id="org5ae2b47"><span class="section-number-3">1.11</span> check</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>m-$: spell check word</li>
<li>m-x flyspell-mode</li>
<li>m-x ispell-region: check a small region</li>
<li>m-x ispell-buffer: check all of the buffer</li>
</ul>
</div>
</div>

<div id="outline-container-orgcc8c7d0" class="outline-3">
<h3 id="orgcc8c7d0"><span class="section-number-3">1.12</span> shell</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>m-x shell: start a bash command line</li>
</ul>
</div>
</div>

<div id="outline-container-orgc5775ca" class="outline-3">
<h3 id="orgc5775ca"><span class="section-number-3">1.13</span> Customize variavle, group, mode, function</h3>
</div>
</div>

<div id="outline-container-orgbb95ca6" class="outline-2">
<h2 id="orgbb95ca6"><span class="section-number-2">2</span> Configuration for project and IDE</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org940ee48" class="outline-3">
<h3 id="org940ee48"><span class="section-number-3">2.1</span> Package Management</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Introduction</li>
</ul>
<p>
MELPA: Milkypostman's Emacs Lisp Package Archives
</p>
<ul class="org-ul">
<li>M-x  package-list-packages</li>
</ul>
<p>
d: delete
i: install
x: execute
</p>
<ul class="org-ul">
<li><a href="https://melpa.org/">melpa.org</a></li>
<li>Add melpa package</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  ;;;initialize package
  (require 'package)
  (setq package-archives '(
  ;			 ("gnu" . "https://elpa.gnu.org/packages/")
;			   ("melpa" . "https://melpa.org/packages/")
			   ("melpa-stable" . "https:://stable.melpa.org/packages/"))
  )
  (package-initialize)
</pre>
</div>
<ul class="org-ul">
<li><p>
Auto install package configuration
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(when (&gt;= emacs-major-version 24)
  (require 'package)
  (package-initialize)
  (add-to-list 'package-archives  '(
				    ("melpa" . "https://melpa.org/packages/"))))
(require 'cl)
;;add whatever package you want here
(defvar yubao/packages '(
			 company
			 )
  "Default packages")
(defun yubao/packages-installed-p ()
  (loop for pkg in yubao/packages
	when (not (package-installed-p pkg)) do (return nil)
	finally (return t)))

(unless (yubao/packages-installed-p)
  (message "%s" "Refreshing package database .... ")
  (package-refresh-contents)
  (dolist (pkg yubao/packages)
    (when (not (package-installed-p pkg))
      (package-install pkg))))
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgef27b20" class="outline-3">
<h3 id="orgef27b20"><span class="section-number-3">2.2</span> linum Mode</h3>
<div class="outline-text-3" id="text-2-2">
<p>
(global-linum-mode t)
(linum-mode t)
</p>
</div>
</div>

<div id="outline-container-org9f488b4" class="outline-3">
<h3 id="org9f488b4"><span class="section-number-3">2.3</span> Company Mode</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="http://company-mode.github.io/">company-mode</a></li>
<li>What's Company Mode?</li>
</ul>
<p>
Company =&gt; company anything
</p>
<ul class="org-ul">
<li>How to enable company mode?</li>
</ul>

<p>
(company-mode t);work on current buffer
(global-company-mode t);work on all the opened buffer
</p>

<p>
Use M-n or M-p to select candidate item
</p>
</div>
</div>
<div id="outline-container-org56d71ba" class="outline-3">
<h3 id="org56d71ba"><span class="section-number-3">2.4</span> Speedbar</h3>
<div class="outline-text-3" id="text-2-4">
<p>
m-x speedbar &lt;enter&gt; or m-x speed &lt;tab&gt; &lt;enter&gt; :list project files
</p>
</div>
</div>
<div id="outline-container-org9b722f4" class="outline-3">
<h3 id="org9b722f4"><span class="section-number-3">2.5</span> Compile</h3>
<div class="outline-text-3" id="text-2-5">
<p>
m-x compile
</p>
</div>
</div>
<div id="outline-container-orga3128cb" class="outline-3">
<h3 id="orga3128cb"><span class="section-number-3">2.6</span> Debug</h3>
<div class="outline-text-3" id="text-2-6">
<p>
c-x ` : jump to the next error. That ` is a back quote on the top left of the keyboard
</p>
</div>
</div>
<div id="outline-container-org7acaa37" class="outline-3">
<h3 id="org7acaa37"><span class="section-number-3">2.7</span> Format</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Auto Update the Sequence Number</li>
</ul>
<p>
Example:
</p>
<ol class="org-ol">
<li>first</li>
<li>second</li>
<li>third</li>
<li>fourth</li>
</ol>

<p>
Then I want to insert one item:   
Example:
</p>
<ol class="org-ol">
<li>first</li>
<li>second</li>
<li>Inserted new item</li>
<li>third</li>
<li>fourth</li>
</ol>

<p>
Therefore, think a question: how to auto sort the list?
</p>

<p>
Method:
</p>

<p>
Move the curser to the end, and press 'M' (meta), and then press Return key.
</p>

<p>
Sorted items:
</p>
<ol class="org-ol">
<li>first</li>
<li>second</li>
<li>Inserted new item</li>
<li>third</li>
<li>fourth</li>

<li>Indent
M-x indent-gegion: indents the region</li>
</ol>
</div>
</div>
<div id="outline-container-orgea4159f" class="outline-3">
<h3 id="orgea4159f"><span class="section-number-3">2.8</span> Show match parents "()"</h3>
<div class="outline-text-3" id="text-2-8">
<p>
[menu]=&gt;[Options]=&gt;[Highlight Matching Parentheses]
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'emacs-lisp-mode-hook 'show-paren-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org75af25c" class="outline-3">
<h3 id="org75af25c"><span class="section-number-3">2.9</span> Highlight current line</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-hl-line-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcd7cee8" class="outline-3">
<h3 id="orgcd7cee8"><span class="section-number-3">2.10</span> Disable backup file (*.~)</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;;disable backup file (*.~)
(setq make-backup-files nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3fc6b4a" class="outline-3">
<h3 id="org3fc6b4a"><span class="section-number-3">2.11</span> Enable Recent Files</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'recentf)
(recentf-mode t)
(setq recentf-max-menu-items 25)
;;uncomment this statement if u want to use shortcut key
(global-set-key "\C-x\ \C-r" 'recentf-open-files)
</pre>
</div>
</div>
</div>
