emacs_studio/howtoUseEmacs.tex

\subsection{search}
\label{sec:org315cc50}
\begin{itemize}
\item c-s text: search
\item c-s TEXT: case sensitive search
\item m-x query-replace <----> m-\%
\item m-x replace-string

\item M-C-s: search a regexp

\item M-s o: searches and shows alll the occurances in an \textbf{Occur} buffer. You can click on the lines to jump to those lines.

\item m-x grep <enter>
\end{itemize}

\subsection{mark}
\label{sec:org38d1dcd}
\begin{itemize}
\item c-space: start/toggle marking a region
\end{itemize}

\subsection{check}
\label{sec:orge4b6fc0}

\begin{itemize}
\item m-\$: spell check word
\item m-x flyspell-mode
\item m-x ispell-region: check a small region
\item m-x ispell-buffer: check all of the buffer
\end{itemize}

\subsection{shell}
\label{sec:orge9a042c}
\begin{itemize}
\item m-x shell: start a bash command line
\end{itemize}

\subsection{Customize variavle, group, mode, function}
\label{sec:orgbfa79ef}

\section{Configuration for project and IDE}
\label{sec:org018c839}
\subsection{Package Management}
\label{sec:orgb7a6a43}
\begin{itemize}
\item Introduction
\end{itemize}
MELPA: Milkypostman's Emacs Lisp Package Archives
\begin{itemize}
\item M-x  package-list-packages
\end{itemize}
d: delete
i: install
x: execute
\begin{itemize}
\item \href{https://melpa.org/}{melpa.org}
\item Add melpa package
\end{itemize}
\begin{verbatim}
  ;;;initialize package
  (require 'package)
  (setq package-archives '(
  ;			 ("gnu" . "https://elpa.gnu.org/packages/")
;			   ("melpa" . "https://melpa.org/packages/")
			   ("melpa-stable" . "https:://stable.melpa.org/packages/"))
  )
  (package-initialize)
\end{verbatim}
\begin{itemize}
\item Auto install package configuration
\begin{verbatim}

(when (>= emacs-major-version 24)
  (require 'package)
  (package-initialize)
  (add-to-list 'package-archives  '(
				    ("melpa" . "https://melpa.org/packages/"))))
(require 'cl)
;;add whatever package you want here
(defvar yubao/packages '(
			 company
			 )
  "Default packages")
(defun yubao/packages-installed-p ()
  (loop for pkg in yubao/packages
	when (not (package-installed-p pkg)) do (return nil)
	finally (return t)))

(unless (yubao/packages-installed-p)
  (message "%s" "Refreshing package database .... ")
  (package-refresh-contents)
  (dolist (pkg yubao/packages)
    (when (not (package-installed-p pkg))
      (package-install pkg))))
\end{verbatim}
\end{itemize}
\subsection{linum Mode}
\label{sec:orga5d2bf8}
(global-linum-mode t)
(linum-mode t)

\subsection{Company Mode}
\label{sec:org9b1370c}
\begin{itemize}
\item \href{http://company-mode.github.io/}{company-mode}
\item What's Company Mode?
\end{itemize}
Company => company anything
\begin{itemize}
\item How to enable company mode?
\end{itemize}

(company-mode t);work on current buffer
(global-company-mode t);work on all the opened buffer

Use M-n or M-p to select candidate item
\subsection{Speedbar}
\label{sec:org2ecdcbf}
m-x speedbar <enter> or m-x speed <tab> <enter> :list project files
\subsection{Compile}
\label{sec:orgbd602fd}
m-x compile
\subsection{Debug}
\label{sec:org05e9f29}
c-x ` : jump to the next error. That ` is a back quote on the top left of the keyboard
\subsection{Format}
\label{sec:org4bcbb1b}
\begin{itemize}
\item Auto Update the Sequence Number
\end{itemize}
Example:
\begin{enumerate}
\item first
\item second
\item third
\item fourth
\end{enumerate}

Then I want to insert one item:   
Example:
\begin{enumerate}
\item first
\item second
\item Inserted new item
\item third
\item fourth
\end{enumerate}

Therefore, think a question: how to auto sort the list?

Method:

Move the curser to the end, and press 'M' (meta), and then press Return key.

Sorted items:
\begin{enumerate}
\item first
\item second
\item Inserted new item
\item third
\item fourth

\item Indent
M-x indent-gegion: indents the region
\end{enumerate}
\subsection{Show match parents "()"}
\label{sec:org97017b6}
[menu]=>[Options]=>[Highlight Matching Parentheses]

\begin{verbatim}
(add-hook 'emacs-lisp-mode-hook 'show-paren-mode)
\end{verbatim}
\subsection{Highlight current line}
\label{sec:orgf946979}
\begin{verbatim}
(global-hl-line-mode t)
\end{verbatim}
\subsection{Disable backup file (*.\textasciitilde{})}
\label{sec:orgb8f56b7}
\begin{verbatim}
;;disable backup file (*.~)
(setq make-backup-files nil)
\end{verbatim}
\subsection{Enable Recent Files}
\label{sec:orgd6b896c}
\begin{verbatim}
(require 'recentf)
(recentf-mode t)
(setq recentf-max-menu-items 25)
;;uncomment this statement if u want to use shortcut key
(global-set-key "\C-x\ \C-r" 'recentf-open-files)
\end{verbatim}
