emacs_studio/howtoUseEmacs.org
** Delete Selection Mode
#+BEGIN_SRC emacs-lisp
;;add delete selection mode
(delete-selection-mode t)
#+END_SRC

** Install Hungary Delete mode
   #+BEGIN_SRC emacs-lisp
   ;;config hungry-delete mode
   (require 'hungry-delete)
   (global-hungry-delete-mode)
   #+END_SRC
** Install a Theme
#+BEGIN_SRC emacs-lisp
  (load-theme 'monokai t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'smex) ; Not needed if you use package.el
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)
;; This is your old M-x.
(global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)
#+END_SRC
** Install swiper and counsel
- [[https://github.com/abo-abo/swiper][swiper]]
- configuration  
  #+BEGIN_SRC emacs-lisp
  (ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "<f6>") 'ivy-resume)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c j") 'counsel-git-grep)
(global-set-key (kbd "C-c k") 'counsel-ag)
(global-set-key (kbd "C-x l") 'counsel-locate)
(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
(define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
  #+END_SRC
** Install and Configure Smartparens mode
- Install
  [[https://github.com/Fuco1/smartparens#getting-started][samartparents]]
- Configure     
#+BEGIN_SRC emacs-lisp
(require 'smartparens-config)
(add-hook 'emacs-lisp-mode-hook 'smartparens-mode)
#+END_SRC
** Configure Javascript IDE
- install js2-mode in Emacs
- Configuration js2-mode
Thde default mode is "javascript mode", use this to change to Javascript IDE:
#+BEGIN_SRC 
;;configure for js2-mode
(setq auto-mode-alist
      (append
       '(("\\.js\\'" . js2-mode))
auto-mode-alist))
#+END_SRC
- Install nodejs in OS
- Install nodejs-repl
- Configure nodejs-repl
  set nodejs-repl-command to "nodejs" in ubuntu system
#+BEGIN_SRC emacs-lisp
;Type M-x nodejs-repl to run Node.js REPL. See also comint-mode to check key bindings.
;You can define key bindings to send JavaScript codes to REPL like below:

(add-hook 'js-mode-hook
          (lambda ()
            (define-key js-mode-map (kbd "C-x C-e") 'nodejs-repl-send-last-sexp)
            (define-key js-mode-map (kbd "C-c C-r") 'nodejs-repl-send-region)
            (define-key js-mode-map (kbd "C-c C-l") 'nodejs-repl-load-file)
            (define-key js-mode-map (kbd "C-c C-z") 'nodejs-repl-switch-to-repl)))	    

#+END_SRC  
* org-mode basics
** Introduction and Common Configuration
*** How to enter source code edit mode
- C-c ' (C-c and single quote) to enter into the source code edit mode, and then use it to turn back
- C-c C-k to abort
- Example:
#+BEGIN_SRC emacs-lisp
;;press "C-c ' " to edit source code
  (message "Emacs lisp")
#+END_SRC
** Schedule and Calenda and Todo
- TODO creating todo and donw items

shift-RightArrow or C-c C-t: togle TODO state
- C-c C-s: to schedule time
- C-c C-d: to set deadline of time
- C-c a: lookup the schedual
*** TODO todo
*** DONE done
** Links
- [[http:www.baidu.com][baidu]] : www.baidu.com  C-c C-l: edit the link

* Emacs Lisp
** Study Resources
- [[https://learnxinyminutes.com/][learnxinyminutes]]
