emacs_studio/howtoUseEmacs.html
<div id="outline-container-orgcfc38da" class="outline-3">
<h3 id="orgcfc38da"><span class="section-number-3">2.12</span> Delete Selection Mode</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;;add delete selection mode
(delete-selection-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org44e793e" class="outline-3">
<h3 id="org44e793e"><span class="section-number-3">2.13</span> Install Hungary Delete mode</h3>
<div class="outline-text-3" id="text-2-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;;config hungry-delete mode
(require 'hungry-delete)
(global-hungry-delete-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga4c20d4" class="outline-3">
<h3 id="orga4c20d4"><span class="section-number-3">2.14</span> Install a Theme</h3>
<div class="outline-text-3" id="text-2-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(load-theme 'monokai t)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'smex) ; Not needed if you use package.el
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)
;; This is your old M-x.
(global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbcda61b" class="outline-3">
<h3 id="orgbcda61b"><span class="section-number-3">2.15</span> Install swiper and counsel</h3>
<div class="outline-text-3" id="text-2-15">
<ul class="org-ul">
<li><a href="https://github.com/abo-abo/swiper">swiper</a></li>
<li><p>
configuration  
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "&lt;f6&gt;") 'ivy-resume)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "&lt;f1&gt; f") 'counsel-describe-function)
(global-set-key (kbd "&lt;f1&gt; v") 'counsel-describe-variable)
(global-set-key (kbd "&lt;f1&gt; l") 'counsel-find-library)
(global-set-key (kbd "&lt;f2&gt; i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "&lt;f2&gt; u") 'counsel-unicode-char)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c j") 'counsel-git-grep)
(global-set-key (kbd "C-c k") 'counsel-ag)
(global-set-key (kbd "C-x l") 'counsel-locate)
(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
(define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org630e8a0" class="outline-3">
<h3 id="org630e8a0"><span class="section-number-3">2.16</span> Install and Configure Smartparens mode</h3>
<div class="outline-text-3" id="text-2-16">
<ul class="org-ul">
<li>Install
<a href="https://github.com/Fuco1/smartparens#getting-started">samartparents</a></li>
<li>Configure</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'smartparens-config)
(add-hook 'emacs-lisp-mode-hook 'smartparens-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org937b1b2" class="outline-3">
<h3 id="org937b1b2"><span class="section-number-3">2.17</span> Configure Javascript IDE</h3>
<div class="outline-text-3" id="text-2-17">
<ul class="org-ul">
<li>install js2-mode in Emacs</li>
<li>Configuration js2-mode</li>
</ul>
<p>
Thde default mode is "javascript mode", use this to change to Javascript IDE:
</p>
<pre class="example">
;;configure for js2-mode
(setq auto-mode-alist
      (append
       '(("\\.js\\'" . js2-mode))
auto-mode-alist))
</pre>
<ul class="org-ul">
<li>Install nodejs in OS</li>
<li>Install nodejs-repl</li>
<li>Configure nodejs-repl
set nodejs-repl-command to "nodejs" in ubuntu system</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">;Type M-x nodejs-repl to run Node.js REPL. See also comint-mode to check key bindings.
;You can define key bindings to send JavaScript codes to REPL like below:

(add-hook 'js-mode-hook
	  (lambda ()
	    (define-key js-mode-map (kbd "C-x C-e") 'nodejs-repl-send-last-sexp)
	    (define-key js-mode-map (kbd "C-c C-r") 'nodejs-repl-send-region)
	    (define-key js-mode-map (kbd "C-c C-l") 'nodejs-repl-load-file)
	    (define-key js-mode-map (kbd "C-c C-z") 'nodejs-repl-switch-to-repl)))	    

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4f37092" class="outline-2">
<h2 id="org4f37092"><span class="section-number-2">3</span> org-mode basics</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org5343615" class="outline-3">
<h3 id="org5343615"><span class="section-number-3">3.1</span> Introduction and Common Configuration</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-org365e2db" class="outline-4">
<h4 id="org365e2db"><span class="section-number-4">3.1.1</span> How to enter source code edit mode</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>C-c ' (C-c and single quote) to enter into the source code edit mode, and then use it to turn back</li>
<li>C-c C-k to abort</li>
<li>Example:</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">;;press "C-c ' " to edit source code
  (message "Emacs lisp")
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org922759c" class="outline-3">
<h3 id="org922759c"><span class="section-number-3">3.2</span> Schedule and Calenda and Todo</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>TODO creating todo and donw items</li>
</ul>

<p>
shift-RightArrow or C-c C-t: togle TODO state
</p>
<ul class="org-ul">
<li>C-c C-s: to schedule time</li>
<li>C-c C-d: to set deadline of time</li>
<li>C-c a: lookup the schedual</li>
</ul>
</div>
<div id="outline-container-orgdfb5a84" class="outline-4">
<h4 id="orgdfb5a84"><span class="section-number-4">3.2.1</span> <span class="todo TODO">TODO</span> todo</h4>
</div>
<div id="outline-container-org66e7474" class="outline-4">
<h4 id="org66e7474"><span class="section-number-4">3.2.2</span> <span class="done DONE">DONE</span> done</h4>
</div>
</div>
<div id="outline-container-org3214647" class="outline-3">
<h3 id="org3214647"><span class="section-number-3">3.3</span> Links</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><a href="http:www.baidu.com">baidu</a> : www.baidu.com  C-c C-l: edit the link</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8638a36" class="outline-2">
<h2 id="org8638a36"><span class="section-number-2">4</span> Emacs Lisp</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org2063eba" class="outline-3">
<h3 id="org2063eba"><span class="section-number-3">4.1</span> Study Resources</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/">learnxinyminutes</a></li>
</ul>
</div>
</div>
