emacs_studio/howtoUseEmacs.tex
\subsection{Delete Selection Mode}
\label{sec:org2257caf}
\begin{verbatim}
;;add delete selection mode
(delete-selection-mode t)
\end{verbatim}

\subsection{Install Hungary Delete mode}
\label{sec:org5146e9f}
\begin{verbatim}
;;config hungry-delete mode
(require 'hungry-delete)
(global-hungry-delete-mode)
\end{verbatim}
\subsection{Install a Theme}
\label{sec:org1f181fb}
\begin{verbatim}
(load-theme 'monokai t)
\end{verbatim}

\begin{verbatim}
(require 'smex) ; Not needed if you use package.el
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)
;; This is your old M-x.
(global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)
\end{verbatim}
\subsection{Install swiper and counsel}
\label{sec:org7a0dca9}
\begin{itemize}
\item \href{https://github.com/abo-abo/swiper}{swiper}
\item configuration  
\begin{verbatim}
  (ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "<f6>") 'ivy-resume)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c j") 'counsel-git-grep)
(global-set-key (kbd "C-c k") 'counsel-ag)
(global-set-key (kbd "C-x l") 'counsel-locate)
(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
(define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
\end{verbatim}
\end{itemize}
\subsection{Install and Configure Smartparens mode}
\label{sec:orgc3631cc}
\begin{itemize}
\item Install
\href{https://github.com/Fuco1/smartparens\#getting-started}{samartparents}
\item Configure
\end{itemize}
\begin{verbatim}
(require 'smartparens-config)
(add-hook 'emacs-lisp-mode-hook 'smartparens-mode)
\end{verbatim}
\subsection{Configure Javascript IDE}
\label{sec:org7a7ca8e}
\begin{itemize}
\item install js2-mode in Emacs
\item Configuration js2-mode
\end{itemize}
Thde default mode is "javascript mode", use this to change to Javascript IDE:
\begin{verbatim}
;;configure for js2-mode
(setq auto-mode-alist
      (append
       '(("\\.js\\'" . js2-mode))
auto-mode-alist))
\end{verbatim}
\begin{itemize}
\item Install nodejs in OS
\item Install nodejs-repl
\item Configure nodejs-repl
set nodejs-repl-command to "nodejs" in ubuntu system
\end{itemize}
\begin{verbatim}
;Type M-x nodejs-repl to run Node.js REPL. See also comint-mode to check key bindings.
;You can define key bindings to send JavaScript codes to REPL like below:

(add-hook 'js-mode-hook
	  (lambda ()
	    (define-key js-mode-map (kbd "C-x C-e") 'nodejs-repl-send-last-sexp)
	    (define-key js-mode-map (kbd "C-c C-r") 'nodejs-repl-send-region)
	    (define-key js-mode-map (kbd "C-c C-l") 'nodejs-repl-load-file)
	    (define-key js-mode-map (kbd "C-c C-z") 'nodejs-repl-switch-to-repl)))	    

\end{verbatim}
\section{org-mode basics}
\label{sec:orga698717}
\subsection{Introduction and Common Configuration}
\label{sec:org80d1339}
\subsubsection{How to enter source code edit mode}
\label{sec:org373ad55}
\begin{itemize}
\item C-c ' (C-c and single quote) to enter into the source code edit mode, and then use it to turn back
\item C-c C-k to abort
\item Example:
\end{itemize}
\begin{verbatim}
;;press "C-c ' " to edit source code
  (message "Emacs lisp")
\end{verbatim}
\subsection{Schedule and Calenda and Todo}
\label{sec:orga95cd24}
\begin{itemize}
\item TODO creating todo and donw items
\end{itemize}

shift-RightArrow or C-c C-t: togle TODO state
\begin{itemize}
\item C-c C-s: to schedule time
\item C-c C-d: to set deadline of time
\item C-c a: lookup the schedual
\end{itemize}
\subsubsection{{\bfseries\sffamily TODO} todo}
\label{sec:orgb086bde}
\subsubsection{{\bfseries\sffamily DONE} done}
\label{sec:org54cf4bd}
\subsection{Links}
\label{sec:orge5f1d9b}
\begin{itemize}
\item \href{http:www.baidu.com}{baidu} : www.baidu.com  C-c C-l: edit the link
\end{itemize}

\section{Emacs Lisp}
\label{sec:org46b4aba}
\subsection{Study Resources}
\label{sec:org78139e1}
\begin{itemize}
\item \href{https://learnxinyminutes.com/}{learnxinyminutes}
\end{itemize}
