emacs_studio/howtoUseEmacs.org
** Command  
- M-: -> :to go to the evaluate buffer where you can evaluate a lisp statement.
For example, "setq" sets a variable to a value: (setq your\_var '123)

- M-x ielm : ELISP, describe-mode for help
- C-x C-e:  runs the command eval-last-sexp (found in global-map)
- M-x eval-buffer :run commands on the current buffer
** Elisp Grammer
*** Example
    #+BEGIN_SRC emacs-lisp
    ;;set a variable
    (setq my-name "yubao")

    ;;show the variable's value
    (message my-name)

    ;;define a func to show my name
    (defun showMyName ()
    (interactive);M-x call
    (message "Hello, %s" my-name)
    )

    ;;call "showMyName" fuction
    (showMyName)
    
    ;;how to bind the key
    (global-set-key (kbd "<C-f2>") 'showMyName)
    
    #+END_SRC
    
*** Variable

*** Function   

   (+ 2 2)
p
* Reference
- [[http://book.emacs-china.org/][MasterEmacsIn21Days]]
- [[https://learnxinyminutes.com/][learnxinyminutes]]
