emacs_studio/howtoUseEmacs.html
<div id="outline-container-org29a9910" class="outline-3">
<h3 id="org29a9910"><span class="section-number-3">4.2</span> Command</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>M-: -&gt; :to go to the evaluate buffer where you can evaluate a lisp statement.</li>
</ul>
<p>
For example, "setq" sets a variable to a value: (setq your\<sub>var</sub> '123)
</p>

<ul class="org-ul">
<li>M-x ielm : ELISP, describe-mode for help</li>
<li>C-x C-e:  runs the command eval-last-sexp (found in global-map)</li>
<li>M-x eval-buffer :run commands on the current buffer</li>
</ul>
</div>
</div>
<div id="outline-container-orgc94da6e" class="outline-3">
<h3 id="orgc94da6e"><span class="section-number-3">4.3</span> Elisp Grammer</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-org54e8be7" class="outline-4">
<h4 id="org54e8be7"><span class="section-number-4">4.3.1</span> Example</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;;set a variable
(setq my-name "yubao")

;;show the variable's value
(message my-name)

;;define a func to show my name
(defun showMyName ()
(interactive);M-x call
(message "Hello, %s" my-name)
)

;;call "showMyName" fuction
(showMyName)

;;how to bind the key
(global-set-key (kbd "&lt;C-f2&gt;") 'showMyName)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgee984b1" class="outline-4">
<h4 id="orgee984b1"><span class="section-number-4">4.3.2</span> Variable</h4>
</div>

<div id="outline-container-org21c148e" class="outline-4">
<h4 id="org21c148e"><span class="section-number-4">4.3.3</span> Function</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
   (+ 2 2)
p
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf8ab219" class="outline-2">
<h2 id="orgf8ab219"><span class="section-number-2">5</span> Reference</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="http://book.emacs-china.org/">MasterEmacsIn21Days</a></li>
<li><a href="https://learnxinyminutes.com/">learnxinyminutes</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yubao</p>
<p class="date">Created: 2017-05-07 Sun 23:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
