emacs_studio/howtoUseEmacs.tex
\subsection{Command}
\label{sec:orgacdecc6}
\begin{itemize}
\item M-: -> :to go to the evaluate buffer where you can evaluate a lisp statement.
\end{itemize}
For example, "setq" sets a variable to a value: (setq your$\backslash$\(_{\text{var}}\) '123)

\begin{itemize}
\item M-x ielm : ELISP, describe-mode for help
\item C-x C-e:  runs the command eval-last-sexp (found in global-map)
\item M-x eval-buffer :run commands on the current buffer
\end{itemize}
\subsection{Elisp Grammer}
\label{sec:org316d97f}
\subsubsection{Example}
\label{sec:orgae17ab6}
\begin{verbatim}
;;set a variable
(setq my-name "yubao")

;;show the variable's value
(message my-name)

;;define a func to show my name
(defun showMyName ()
(interactive);M-x call
(message "Hello, %s" my-name)
)

;;call "showMyName" fuction
(showMyName)

;;how to bind the key
(global-set-key (kbd "<C-f2>") 'showMyName)

\end{verbatim}

\subsubsection{Variable}
\label{sec:org0729716}

\subsubsection{Function}
\label{sec:orgb22abc7}

   (+ 2 2)
p
\section{Reference}
\label{sec:org8a263f2}
\begin{itemize}
\item \href{http://book.emacs-china.org/}{MasterEmacsIn21Days}
\item \href{https://learnxinyminutes.com/}{learnxinyminutes}
\end{itemize}
\end{document}